; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-75)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l5)
    (at p3 l7)
    (at p4 l10)
    (at p5 l7)
    (at p6 l14)
    (at p7 l10)
    (at p8 l2)
    (at p9 l8)
    (at p10 l2)
    (at p11 l6)
    (at p12 l13)
    (at p13 l9)
    (at v1 l6)
    (at v2 l8)
    (at v3 l1)
    (at v4 l9)
    (at v5 l13)
    (at v6 l9)
    (road l12 l1)
    (road l14 l4)
    (road l12 l10)
    (road l4 l9)
    (road l12 l13)
    (road l14 l10)
    (road l9 l2)
    (road l5 l13)
    (road l3 l13)
    (road l13 l5)
    (road l10 l12)
    (road l13 l11)
    (road l1 l12)
    (road l6 l14)
    (road l14 l6)
    (road l4 l14)
    (road l8 l5)
    (road l9 l4)
    (road l10 l14)
    (road l11 l13)
    (road l5 l8)
    (road l8 l7)
    (road l13 l3)
    (road l2 l9)
    (road l13 l12)
    (road l7 l8)
    (road l2 l6)
    (road l6 l2)
    (road l11 l14)
    (road l14 l11)
    (road l4 l5)
    (road l5 l4)
    (road l3 l4)
    (road l4 l3)
    (road l8 l12)
    (road l12 l8)
    (road l2 l11)
    (road l11 l2)
    (road l1 l9)
    (road l9 l1)
    (road l11 l12)
    (road l12 l11)
    (road l10 l11)
    (road l11 l10)
    (road l1 l2)
    (road l2 l1)
    (road l10 l13)
    (road l13 l10)
    (road l2 l3)
    (road l3 l2)
    (road l6 l7)
    (road l7 l6)
    )
 (:goal (and 
(at p3 l6)
))
)

; plan
1. (drive v2 l8 l7)
   deleted: (at v2 l8)
   added: (at v2 l7)
   goals met: 0 of 1
2. (pick-up v2 l7 p3 c0 c1)
   deleted: (at p3 l7) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 0 of 1
3. (drive v2 l7 l6)
   deleted: (at v2 l7)
   added: (at v2 l6)
   goals met: 0 of 1
4. (drop v2 l6 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l6) (capacity v2 c1)
   goals met: 1 of 1
